IDEA Open Model
IdeaBeamImportSettings.BeamFileName Property
Compatible with IDEA StatiCa v 10.1
 Gets or sets the name of the Beam project
 Namespace: IdeaRS.OpenModel.Beam
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public string BeamFileName { get; set; }
Public Property BeamFileName As String
	Get
	Set
public:
property String^ BeamFileName {
	String^ get ();
	void set (String^ value);
}
Property Value
Type: String
See Also
Reference
IdeaBeamImportSettings Class
IdeaRS.OpenModel.Beam Namespace